7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data=pd.Series([1.2,-3.5,np.nan,0])

In [3]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data=pd.Series([
    "aardvark",np.nan,None,"avocado"
])

In [9]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [10]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [11]:
float_data=pd.Series([1,2,None],dtype="float64")

In [12]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [13]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## Table 7-1. NA handling object methods

| Method   | Description                                                                 | Example (Python) | Output |
|----------|-----------------------------------------------------------------------------|------------------|--------|
| `dropna` | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate | `pd.Series([1, np.nan, 3]).dropna()` | `[1.0, 3.0]` |
| `fillna` | Fill in missing data with some value or using an interpolation method such as `"ffill"` or `"bfill"` | `pd.Series([1, np.nan, 3]).fillna(0)` | `[1.0, 0.0, 3.0]` |
| `isna`   | Return Boolean values indicating which values are missing/NA                | `pd.Series([1, np.nan, 3]).isna()` | `[False, True, False]` |
| `notna`  | Negation of `isna`, returns True for non-NA values and False for NA values  | `pd.Series([1, np.nan, 3]).notna()` | `[True, False, True]` |

Filtering Out Missing Data

In [16]:
data=pd.Series(
    [
        1,np.nan,3.5,np.nan,7
    ]
)

In [17]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [15]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],                   
[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

Passing how="all" will drop only rows that are all NA:

In [22]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4]=np.nan

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

To drop columns in the same way, pass axis="columns":

In [28]:
data.dropna(axis="columns",how="all") # use rows instead of columns

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [38]:
df=pd.DataFrame(np.random.standard_normal((7,3)))

In [39]:
df

          0         1         2
0 -0.098272  1.669512 -0.608732
1 -1.164949 -1.051988 -0.274587
2  0.420070 -0.158215  1.346672
3 -0.059219 -0.524891  0.157957
4  0.659670  1.407219 -1.223984
5  0.926060  0.130834 -2.236518
6 -2.236190  0.363486 -0.262260

In [40]:
df.iloc[:4:1]=np.nan

In [41]:
df.iloc[:2,2]=np.nan

In [42]:
df

         0         1         2
0      NaN       NaN       NaN
1      NaN       NaN       NaN
2      NaN       NaN       NaN
3      NaN       NaN       NaN
4  0.65967  1.407219 -1.223984
5  0.92606  0.130834 -2.236518
6 -2.23619  0.363486 -0.262260

In [43]:
df.dropna()

         0         1         2
4  0.65967  1.407219 -1.223984
5  0.92606  0.130834 -2.236518
6 -2.23619  0.363486 -0.262260

thresh=2 â†’ Sets a threshold: a row must have at least 2 non-NaN values to be kept.

If a row has fewer than 2 non-null entries, it will be dropped.

In [44]:
df.dropna(thresh=2)

         0         1         2
4  0.65967  1.407219 -1.223984
5  0.92606  0.130834 -2.236518
6 -2.23619  0.363486 -0.262260

# Filling In Missing Data

In [45]:
df.fillna(0)

         0         1         2
0  0.00000  0.000000  0.000000
1  0.00000  0.000000  0.000000
2  0.00000  0.000000  0.000000
3  0.00000  0.000000  0.000000
4  0.65967  1.407219 -1.223984
5  0.92606  0.130834 -2.236518
6 -2.23619  0.363486 -0.262260

In [46]:
df.fillna(
    {1:0.5,2:0}
)

         0         1         2
0      NaN  0.500000  0.000000
1      NaN  0.500000  0.000000
2      NaN  0.500000  0.000000
3      NaN  0.500000  0.000000
4  0.65967  1.407219 -1.223984
5  0.92606  0.130834 -2.236518
6 -2.23619  0.363486 -0.262260

In [47]:
df=pd.DataFrame(np.random.standard_normal((6,3)))

In [48]:
df

          0         1         2
0 -0.031964 -0.217009 -1.805714
1 -0.244118  0.908295 -0.287153
2 -0.841317 -1.633387 -0.005172
3  2.657350 -0.215324 -0.725196
4 -0.164561  2.039083  0.053468
5 -0.875722  0.726936  0.728331

In [49]:
df.iloc[2:,1]=np.nan

In [51]:
df.iloc[4:,2]=np.nan

In [52]:
df

          0         1         2
0 -0.031964 -0.217009 -1.805714
1 -0.244118  0.908295 -0.287153
2 -0.841317       NaN -0.005172
3  2.657350       NaN -0.725196
4 -0.164561       NaN       NaN
5 -0.875722       NaN       NaN

In [53]:
df.fillna(method="ffill")

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_45500\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.031964 -0.217009 -1.805714
1 -0.244118  0.908295 -0.287153
2 -0.841317  0.908295 -0.005172
3  2.657350  0.908295 -0.725196
4 -0.164561  0.908295 -0.725196
5 -0.875722  0.908295 -0.725196

In [54]:
df.fillna(method="ffill",limit=2)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_45500\3768739427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0 -0.031964 -0.217009 -1.805714
1 -0.244118  0.908295 -0.287153
2 -0.841317  0.908295 -0.005172
3  2.657350  0.908295 -0.725196
4 -0.164561       NaN -0.725196
5 -0.875722       NaN -0.725196

In [56]:
data=pd.Series(
    [1.,np.nan,3.5,np.nan,7]
)

In [57]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [58]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Table 7-2. `fillna` function arguments

| Argument | Description                                                                 | Example (Python) | Output |
|----------|-----------------------------------------------------------------------------|------------------|--------|
| `value`  | Scalar value or dictionary-like object to use to fill missing values        | `pd.Series([1, np.nan, 3]).fillna(value=0)` | `[1.0, 0.0, 3.0]` |
| `method` | Interpolation method: `"bfill"` (backward fill) or `"ffill"` (forward fill); default is `None` | `pd.Series([1, np.nan, np.nan, 4]).fillna(method="ffill")` | `[1.0, 1.0, 1.0, 4.0]` |
| `axis`   | Axis to fill on (`"index"` or `"columns"`); default is `"index"`            | `df.fillna(method="ffill", axis="columns")` | Missing values filled column-wise |
| `limit`  | For forward/backward filling, maximum number of consecutive periods to fill | `pd.Series([1, np.nan, np.nan, 4]).fillna(method="ffill", limit=1)` | `[1.0, 1.0, NaN, 4.0]` |

# 7.2 Data Transformation

Removing Duplicates

In [60]:
data=pd.DataFrame({
    "k1":["one","two"]*3+["two"],
    "k2":[1,1,2,3,3,4,4]
})

In [61]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [62]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [63]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [64]:
data["v1"]=range(7)

In [65]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [69]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [75]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [76]:
data.drop_duplicates(["k1", "k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

Transforming Data Using a Function or Mapping

In [77]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                             "pastrami", "corned beef", "bacon",
                             "pastrami", "honey ham", "nova lox"],
                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [78]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [79]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [80]:
data["animal"]=data["food"].map(meat_to_animal)

In [81]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [82]:
def get_animal(x):
    return meat_to_animal[x]

In [83]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Replacing Values

In [84]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [85]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [86]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [87]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [88]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Renaming Axis Indexes

In [89]:
data=pd.DataFrame(
    np.arange(12).reshape((3,4)),
    index=["Ohio","Colorado","New York"],
    columns=["one","two","three","four"]
)

In [90]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [91]:
def transform(x):
    return x[:4].upper()

In [92]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [93]:
data.index=data.index.map(transform)

In [94]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [95]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [96]:
data.rename(
    index={"OHIO":"INDIANA"},
    columns={"three":"peekaboo"}
)

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

# Discretization and Binning

In [97]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [98]:
bins=[18, 25, 35, 60, 100]

In [99]:
age_catgeories=pd.cut(ages,bins)

In [100]:
age_catgeories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [101]:
age_catgeories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [102]:
age_catgeories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [103]:
age_catgeories.categories[0]

Interval(18, 25, closed='right')

In [104]:
pd.value_counts(age_catgeories)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_45500\3827431093.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_catgeories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [105]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [106]:
group_names=["Youth","YoungAdult","MiddleAged","Senior"]

In [111]:
pd.cut(ages,bins,labels=group_names)
data1=pd.cut(ages,bins,labels=group_names)

In [112]:
data1.value_counts()

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
Name: count, dtype: int64

In [116]:
data=np.random.uniform(size=20)

In [117]:
data

array([0.345369  , 0.44076752, 0.02452659, 0.86867963, 0.29155676,
       0.01467201, 0.00276601, 0.11381718, 0.98834332, 0.77033176,
       0.40374968, 0.00951945, 0.98298375, 0.16202593, 0.30089192,
       0.06507449, 0.97836562, 0.45462466, 0.45526557, 0.54778066])

In [125]:
pd.cut(data,4,precision=2)

[(-1.59, -0.072], (-0.072, 1.44], (-0.072, 1.44], (-1.59, -0.072], (-1.59, -0.072], ..., (-0.072, 1.44], (-1.59, -0.072], (-0.072, 1.44], (-0.072, 1.44], (-3.11, -1.59]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.11, -1.59] < (-1.59, -0.072] < (-0.072, 1.44] < (1.44, 2.96]]

In [126]:
data=np.random.standard_normal(1000)

In [127]:
data

array([ 1.21179486e+00,  1.23130391e+00, -4.12725737e-01, -1.21563407e+00,
        2.13150853e-01, -2.42371643e+00,  5.83258639e-01,  1.62047102e-01,
       -3.34608821e-01, -1.51087867e+00,  1.61253374e+00, -1.13376848e-01,
        3.96463765e-01, -2.04280954e-01,  1.01513898e+00, -3.83200797e-01,
       -1.38711621e+00,  1.06515310e-01,  1.85918035e+00,  3.92594078e-01,
       -1.25487522e+00,  7.22395469e-01,  7.75130404e-01,  3.09137371e-01,
       -1.01692421e+00,  2.45501653e-01,  1.13363774e+00,  3.34522474e-01,
       -9.73312102e-01, -5.03135469e-01, -2.23106903e-01,  5.77254719e-01,
        1.00269811e+00,  1.22605625e+00, -1.42660698e+00, -2.00784850e+00,
        2.68391729e+00, -4.89530548e-01, -7.12006008e-01, -3.38498562e-01,
       -9.98298473e-01, -2.23460661e-01, -1.10868369e+00, -6.36480948e-02,
       -8.50943594e-01, -1.46102238e-01, -1.95643255e+00,  2.50202205e-01,
        4.03074395e-01, -1.87853034e-01, -9.51393001e-01,  1.74936291e-01,
       -2.53270861e+00,  9.78972243e-01,  8.39233945e-02,  4.02688634e-01,
       -2.30590156e-01,  2.43811749e+00, -9.13012675e-02, -1.13752727e+00,
        1.34249849e+00, -1.81218159e+00,  9.43130283e-01, -1.48822257e-01,
       -2.21677374e-01, -2.55719480e-01,  7.77550819e-01, -6.57743090e-01,
        6.08467849e-01, -1.44465597e+00,  6.04927564e-01,  7.20055662e-01,
       -8.94812599e-01,  2.35139561e+00,  8.01017658e-01,  7.23448889e-02,
        3.57498650e-01,  6.08115087e-01, -6.58569138e-01,  3.09510791e-01,
       -7.23212886e-01,  3.96345882e-01, -6.91821856e-01, -1.25556149e+00,
       -6.46171606e-01, -3.08220400e-01,  1.32085689e+00, -1.39064183e-01,
       -6.22834377e-01, -2.33608307e+00, -6.27420495e-01, -9.19974236e-02,
       -2.04611432e+00,  9.47685922e-01, -1.25418020e-01,  5.78518672e-01,
        5.37985641e-01,  1.09183991e+00, -8.80753516e-01, -5.78160269e-01,
       -1.10164732e+00,  2.26862585e-01,  1.96972700e+00,  1.07272359e+00,
       -1.50399221e+00,  1.17538984e+00, -1.83101946e-01,  9.72528749e-02,
        1.22860127e+00, -5.82918373e-01,  6.38289979e-01, -8.34904658e-01,
        1.97077221e+00, -2.97663210e+00,  1.07462409e+00, -4.75644566e-01,
        1.14542413e+00, -1.54843630e+00,  3.79817361e-01,  6.32647217e-01,
       -8.40333755e-01,  1.72377763e-01, -1.46690561e-01,  2.08902464e-01,
       -4.62509909e-01,  6.63262740e-01, -1.39537035e+00, -6.38894638e-01,
        5.79262626e-01,  2.97093753e+00, -8.87145875e-01, -8.13948663e-01,
       -4.92837335e-01, -5.68919671e-01, -4.15055837e-01, -4.51887850e-01,
       -1.24318791e+00,  7.45395890e-01,  8.36027743e-01, -1.85989845e-01,
        6.14393293e-01,  1.46170600e-01,  1.33386143e+00, -2.71010141e-01,
       -9.20519679e-02, -1.17120176e+00,  4.46870530e-01,  8.75609316e-01,
        1.43813858e+00, -1.19328545e+00, -9.93053718e-01,  3.65285558e-01,
        1.03995786e+00, -1.40037921e+00, -8.73458736e-01,  8.41494781e-03,
        2.41299238e-01, -1.22831632e-01, -3.78837193e-01, -4.37557444e-01,
        1.73369092e+00,  1.67437144e+00, -1.71636865e-01, -8.14151917e-01,
       -5.13801914e-01, -1.27495896e+00, -1.00227743e+00,  4.69796636e-01,
        1.56546921e+00,  3.76012108e-01, -3.30615844e-01,  1.15920357e-01,
        1.02623110e+00, -2.06075537e+00,  8.11644713e-01, -1.00820090e+00,
       -1.70851452e+00,  1.95434826e+00, -3.51685671e-01, -4.45604506e-01,
        2.80999203e-01, -8.78147459e-01, -4.95130880e-01,  1.09205124e+00,
        2.06845833e-01,  1.96584165e+00, -1.61738645e+00,  4.94014791e-01,
       -1.43869128e+00, -9.85697227e-01,  8.16608372e-01,  1.53595094e+00,
       -1.74047103e+00,  1.98654485e+00,  8.99674310e-01,  5.69991170e-01,
        2.50391962e+00,  2.28306013e-01, -1.03017188e+00, -4.90002426e-01,
       -1.89073739e-01, -1.99717424e-01, -4.33905878e-01, -1.58362508e+00,
       -1.35253444e-01,  1.41643405e+00,  5.29567565e-01,  4.75560792e-01,
        7.08122872e-01, -7.82824467e-01,  4.10777886e-01, -2.80275738e-01,
       -2.42379443e+00, -1.47848516e-01, -9.52224634e-01,  1.09131653e+00,
        1.63642994e-01,  2.20871096e+00, -1.68679029e+00,  3.73255737e-01,
       -1.17388514e+00,  8.62690895e-01,  1.20338338e+00,  9.07131208e-01,
        5.63146258e-01,  1.23326985e+00,  8.81007982e-01,  1.37105692e+00,
        2.10034278e-03,  1.54010502e+00,  5.93398989e-01,  3.06849861e-01,
        1.21351834e+00, -1.85937128e+00, -1.26700396e-02, -1.11057610e+00,
        1.11285561e-01, -4.33696195e-01,  6.01339327e-02,  1.58057600e-01,
       -2.35257752e-01,  5.53800473e-01, -7.27568606e-01,  3.41037604e+00,
        4.75549778e-01, -3.10770464e-01,  7.68733037e-01, -1.35856778e+00,
        4.47224703e-02,  1.49452305e-01, -1.59923059e+00,  2.41746898e-01,
        1.39346297e+00, -5.69293940e-01,  1.03939790e+00,  6.65004852e-01,
       -2.41272247e-01, -1.12587837e+00,  6.45242171e-02,  7.05291843e-01,
       -2.78757278e-01, -7.88608580e-01, -6.91829225e-01, -1.43324702e+00,
        5.86051486e-01,  8.12328765e-01, -6.89339320e-03,  8.44278131e-01,
       -1.36499003e-01, -2.91358916e+00,  5.86784983e-01, -7.61049113e-01,
       -1.05510808e+00,  1.14743651e+00, -7.26938381e-01, -1.18784600e+00,
       -7.17480548e-01,  1.20086565e+00,  5.26787907e-01, -9.20109066e-02,
       -5.64088780e-01,  6.26956176e-02, -4.11535851e-01,  8.11847008e-01,
        6.36195932e-01,  7.28818553e-01,  1.15296009e+00,  9.22505684e-02,
       -1.66367893e+00,  4.58826896e-01, -6.95836499e-01,  4.08145331e-01,
        3.16307033e-01, -2.65461621e-01, -9.07915872e-01,  1.86414294e+00,
       -2.74979271e-01,  1.47656248e+00,  1.13850477e+00, -1.15162485e-01,
        9.29384957e-01,  7.67559838e-01, -1.52730281e+00, -1.96240708e+00,
        2.70352676e-01,  8.31522644e-01, -2.42295461e-01, -1.41934507e+00,
       -6.65270098e-02, -1.70836913e-02,  1.22388737e+00, -8.51369096e-02,
       -1.90911448e+00,  5.77042830e-01,  2.43193391e-01, -1.70882540e-01,
       -9.56362026e-01,  8.05792830e-02,  1.48743722e+00, -3.20194504e-01,
        2.89080242e-01, -2.46723330e-01,  3.99972271e-01, -1.44810774e+00,
       -3.14094347e-01,  1.05585861e+00, -2.44871312e-01,  1.25901333e-01,
        1.04335098e+00, -1.18078631e+00, -1.24607752e-01,  4.91408672e-01,
        6.14341139e-01, -1.18519190e+00,  1.18073619e+00, -4.00476209e-01,
       -1.65575660e+00, -6.66838536e-02, -6.09507204e-01, -8.33933447e-01,
        2.01944219e+00, -1.01117058e+00,  8.72077247e-01, -7.18387754e-01,
        1.17876326e-01,  7.35054083e-01, -1.75357290e-01, -1.17447956e-01,
       -2.00587787e+00,  2.56106955e-01, -2.55148217e-01,  2.30460491e-01,
       -9.06405830e-01,  9.70702263e-02,  1.81888362e+00, -4.61333010e-01,
       -9.68787809e-01,  9.39761085e-01, -7.87884587e-01,  7.48582536e-01,
       -1.52042323e+00, -2.41922739e-01, -6.91049727e-01,  8.64449199e-01,
        1.70547164e-01, -8.77174661e-01, -1.39387598e+00,  5.05053566e-01,
        9.27310663e-01, -9.94518397e-02,  1.50232664e+00,  9.17998130e-01,
       -7.94471154e-01, -1.62630843e+00, -2.53212325e-01, -1.12381151e+00,
        7.65793936e-02,  7.63242342e-01,  3.24708360e-01,  1.23691695e+00,
       -4.55377152e-01,  1.90406421e+00,  6.90986807e-01,  9.98571243e-01,
       -1.18187977e+00,  5.99592427e-01,  1.44406181e+00,  1.17309904e-01,
        1.19199082e+00,  1.02094303e+00, -1.15145576e+00, -9.41435701e-02,
        7.85205846e-01,  2.91992879e-01,  6.03027857e-02, -6.80554448e-01,
        1.75377746e-01,  3.34714141e-01,  6.29342835e-01,  3.65830314e-01,
        1.06843868e+00, -1.37683265e+00,  1.20642881e-01, -1.12615247e+00,
       -1.38988234e-01, -1.38829784e+00,  9.67104102e-01, -1.60086041e+00,
       -5.11611824e-02,  3.83892209e-01, -4.48911024e-01,  1.03775655e+00,
        1.16006801e+00, -8.93795644e-01,  6.98908069e-02, -3.36899889e-01,
        3.37662717e-01,  1.17518221e-01, -1.09627741e+00,  2.80910236e-02,
        9.85850816e-02,  1.88971818e+00,  1.33084188e-01,  1.04017654e+00,
       -2.83353869e-01,  1.28712247e-01, -6.51830070e-01,  5.66876202e-01,
       -8.39010325e-01,  3.88530528e-01, -5.93014161e-01, -1.31341122e-02,
        7.49779740e-01, -3.00929353e-01, -1.58854514e+00, -6.51701019e-01,
       -9.96091493e-01,  1.26457330e+00, -1.70368408e-01,  6.18846673e-02,
       -3.76874935e-01,  1.62897571e+00,  1.47308395e+00,  1.07531464e+00,
       -2.03517824e+00,  1.51349753e+00,  1.10186213e-01, -1.04987515e+00,
        1.58654423e+00, -6.23046109e-01,  1.49452472e+00,  1.39916093e-01,
       -9.92387935e-01, -2.91242768e-02,  8.73566740e-01,  1.46262815e+00,
        5.10453329e-01, -4.57202671e-01,  3.03974604e+00,  4.83589698e-01,
       -8.15996107e-01, -1.46227892e+00,  3.17314411e-02,  6.64539973e-01,
       -4.82113889e-01, -1.15264257e+00, -3.75845342e-01,  4.34994424e-01,
       -2.21779485e+00, -2.66395180e-01,  1.05389704e+00,  9.27977367e-01,
       -9.12652361e-03, -4.92609285e-01, -8.43608267e-01, -1.05911980e-02,
       -4.99246089e-01,  7.85730161e-01, -1.62903532e+00, -3.63150260e-01,
        5.36262867e-01, -1.50374009e+00,  7.47150240e-01, -1.62162369e+00,
       -1.00629949e+00,  6.35593280e-01, -6.69491786e-01, -9.44584853e-01,
        1.44116895e-01,  1.62278657e-01,  3.49185757e-01,  7.44983220e-01,
        7.74553583e-01, -2.89523733e-02,  1.19591781e+00, -6.48594147e-01,
       -1.87729190e-01,  1.34127212e+00,  8.82269662e-01,  8.57115652e-01,
        8.19502546e-01,  3.72124692e-01,  1.36797631e-01, -6.56258071e-01,
        5.44122683e-01,  1.87721842e+00,  1.67998280e-01,  9.38602190e-01,
        4.74237560e-01,  5.91275428e-01, -1.10328329e+00,  1.16520581e+00,
       -2.29593334e+00, -8.69944568e-01,  1.12315942e+00,  1.50392710e+00,
        9.69735655e-01,  8.93821528e-01, -1.17822753e+00,  1.02395047e+00,
        7.00895679e-01, -3.94709093e-01, -8.23580858e-02,  9.03102016e-01,
       -5.98643180e-02,  7.93230813e-01, -3.21362253e-02, -5.20943768e-01,
        1.90527365e+00, -4.87710443e-01,  4.22981770e-02,  1.08637296e+00,
        3.40661860e-01,  5.35063186e-01, -2.27420564e-01, -2.65191793e-01,
        1.09564694e+00, -2.22568234e-01, -6.16038952e-01,  8.45874954e-02,
        1.30097930e-01,  1.28830848e+00,  1.03146795e+00, -1.05898751e+00,
       -7.33333181e-02,  2.36620146e+00, -4.05215789e-01,  4.71730567e-01,
        1.33759046e+00, -1.82126535e+00,  6.01774810e-01, -8.88749351e-01,
       -7.64950660e-01, -9.76686423e-01, -7.52165984e-03,  4.48498371e-01,
        4.74195598e-01,  1.50134426e+00, -8.05283478e-01,  1.46847652e+00,
       -1.10073130e-01, -1.04205826e+00, -1.34852703e+00, -3.84459667e-01,
        8.05248263e-01,  1.22967348e+00,  9.86791026e-02, -4.58149734e-03,
       -2.50187053e+00, -3.10024413e+00, -1.44382825e+00,  1.37237568e+00,
        1.43113903e+00,  2.97329178e-01,  7.51439171e-01, -1.03417583e+00,
       -1.57699386e+00, -7.90790060e-01, -1.48583648e+00,  2.37801141e+00,
        1.53044367e-01, -1.21834453e-01,  1.16936565e-01, -9.17396164e-01,
        7.22645443e-01, -7.68107460e-01, -1.83626696e+00, -1.05358899e+00,
       -1.49481392e-01, -3.98665294e-01, -1.31198815e+00, -1.33610194e+00,
        9.21196796e-01,  6.37657102e-01,  2.21170155e-01,  9.07650272e-01,
       -9.55385087e-01,  7.60738248e-01,  2.06870177e-01,  1.92940244e-01,
        5.86544874e-02, -2.03037578e+00, -8.16424067e-02, -1.23692644e+00,
       -1.34617033e+00,  6.41018938e-01, -4.81165020e-01, -4.16465002e-02,
       -2.27590213e-01, -3.25333196e-01, -2.33239474e-01, -1.48865820e-01,
        6.85843038e-01, -1.91437668e-01,  8.08165110e-01, -2.88154271e-01,
       -4.66913383e-01, -1.65250684e-01,  7.36904136e-01, -1.29192686e-01,
        9.96559732e-01,  3.33827838e-01,  1.36906765e-01, -1.75821707e+00,
       -2.89451730e-01, -8.65629637e-01,  5.56314145e-01, -9.05389645e-01,
        8.96104345e-01, -6.78572476e-01,  1.39149374e+00, -4.64022515e-01,
        1.05707591e-01,  2.85342925e-01, -1.25489836e+00,  2.45585982e-01,
       -5.64051162e-01,  1.11746126e+00,  1.06936639e+00,  3.14133796e-02,
        6.72249978e-01, -7.42847422e-01, -2.42736006e-01, -1.36787447e-01,
       -1.01213027e+00,  9.44318025e-01, -1.42681873e+00, -4.20811571e-01,
        2.91458409e-01, -1.84595457e-01,  1.46304473e+00, -8.30033914e-01,
        1.70134670e-01, -4.91934979e-01, -1.06272729e+00,  6.33693638e-01,
       -1.23429566e+00,  8.17179475e-01,  4.81126618e-01, -1.49712312e+00,
        8.86185810e-01,  5.14062192e-02, -3.71047929e-02, -1.78362006e+00,
        2.21610805e+00,  3.81493385e-01,  6.82625181e-01, -4.54086517e-01,
        1.61670695e+00, -2.83199836e-01, -1.52708083e+00,  4.28556276e-01,
       -1.45103653e+00,  2.51670371e+00,  1.41736379e+00,  1.94869176e+00,
       -1.16176316e+00, -1.15655876e+00,  4.20325683e-01,  1.49602474e+00,
       -7.55845444e-01,  1.16571046e+00, -6.07232671e-01,  3.52078244e-02,
       -2.93403830e-01, -4.08334533e-01, -1.14181916e+00,  5.17955047e-01,
        6.62797888e-01, -1.32291022e+00,  7.18661314e-01, -4.34062813e-01,
       -3.50809894e-01, -1.15967969e+00, -4.05260373e-01,  3.32364296e-01,
       -7.38095482e-01, -2.70890547e-01,  9.99812095e-01, -2.13975093e-01,
        1.16202515e+00,  5.10420423e-01, -2.12972486e+00,  1.24220125e+00,
        6.07043209e-01, -1.04807713e+00,  1.76169076e-01, -1.98049929e-01,
        3.23312272e-01,  1.70397523e-01, -2.32840406e+00, -1.62311962e+00,
       -8.44947543e-01,  2.50635788e-01,  2.29388484e-01,  5.86732237e-01,
       -7.73739125e-02, -6.03461544e-01,  3.03913016e-01,  9.06607254e-01,
        1.60433449e+00, -1.63273265e+00,  5.78896601e-01,  1.79446880e-01,
       -1.69381772e-01,  1.64574362e-01,  3.38389419e-01, -4.83587184e-02,
       -1.33993346e+00, -4.83271445e-01,  2.04806718e-01,  4.47815190e-02,
       -1.46923857e+00,  2.11592558e-01, -8.02627542e-01, -3.21595532e-01,
        1.02132472e+00, -9.92451720e-01,  4.88258946e-01, -1.96791741e-01,
        1.24547271e+00,  2.50845326e+00,  5.66021660e-01,  4.45031550e-01,
        1.11848488e+00,  5.03417973e-01,  4.66120005e-02,  1.12125421e+00,
       -5.74434406e-01,  7.82671273e-01,  4.06264509e-01, -1.93571580e-01,
        2.66120497e-01, -3.34568546e-02,  2.27177456e-01, -8.69939650e-01,
        8.97075351e-01, -1.18625537e+00,  1.54730384e+00, -1.00626277e+00,
       -9.35588766e-01, -7.15695576e-01, -9.34150382e-01,  6.89264288e-02,
        1.23797401e-01,  7.45373250e-01, -6.30557389e-01, -6.52448852e-01,
       -3.93977409e-01, -8.57004645e-01, -6.40016503e-03,  3.31040907e-01,
        2.14052673e-02, -1.12800518e+00, -1.13921145e+00,  2.13598360e+00,
       -4.29887697e-01, -5.54662191e-01,  2.26959921e-01, -9.78836530e-01,
        2.17242285e-02, -1.04879041e+00,  3.02888925e-01,  1.59864581e+00,
       -1.97649630e-02,  1.96573974e+00,  5.14972039e-01, -1.90184270e+00,
        3.59578384e-01, -9.30091982e-01,  1.45028575e+00, -1.49698412e+00,
        6.32169581e-01,  1.88617800e-01,  6.21600288e-01, -1.58830974e-01,
        1.81049950e+00,  6.56999543e-01,  1.28088543e+00, -9.29678555e-01,
        4.17188842e-01, -1.73638258e-01, -1.91249595e-01, -5.22821329e-01,
       -1.28507684e+00, -4.48841591e-01,  9.97505523e-01,  1.20844903e+00,
        1.64063460e-01, -1.19313465e+00,  2.81621381e+00, -4.06170121e-01,
       -8.59132801e-01,  4.93874672e-01, -6.78118405e-01, -2.77017929e-01,
        7.51036518e-01, -8.64754924e-01, -8.16528644e-01,  6.75750273e-02,
        2.37752689e-01,  2.87328597e-01,  2.41924407e-01, -1.97401580e+00,
        1.28221921e+00, -8.54112792e-01, -4.41514928e-01,  6.80400233e-01,
        8.54618863e-01, -7.91851327e-01, -8.16896413e-01, -2.11401993e+00,
       -5.99306012e-01, -3.44108800e-01,  4.15086534e-01, -1.34436411e+00,
       -2.45406458e-01,  8.31753224e-01, -4.01273213e-01, -2.04867854e+00,
       -5.76678566e-01,  1.31216940e-01,  1.04893104e+00, -9.93220045e-01,
        1.43322588e+00, -1.52914481e+00, -3.09955652e-01,  1.06609872e+00,
       -3.37959873e-01,  3.70341062e-01, -4.40201496e-01,  9.43852530e-01,
        9.02186601e-01,  1.15186359e+00,  6.04854068e-01, -2.26439113e-01,
        1.70042494e+00, -4.17915510e-01,  1.70978988e-01,  5.06553264e-01,
       -9.64556661e-01,  6.18544484e-01,  7.27308686e-01,  1.20601020e+00,
       -1.34691533e-01, -1.75568311e+00,  7.80285146e-01, -2.24906079e-01,
       -5.44096727e-02,  1.22592345e-01,  1.34589361e-01, -8.32256323e-01,
       -1.13799860e-01, -2.91825301e-01, -1.45629149e+00, -7.48290984e-01,
        2.83637692e-01, -1.10106979e+00,  1.32907424e+00, -1.77731397e+00,
        1.05583377e+00,  4.38580948e-01,  1.96187131e-01, -1.74917849e+00,
       -1.16635442e+00,  6.83980499e-01, -2.99108951e-01,  2.72442472e-01,
       -1.55050850e+00, -6.95771355e-01,  1.44618099e+00, -5.82665870e-02,
        9.16258311e-01, -5.45625593e-01, -5.55385667e-01, -1.95150069e+00,
       -6.97471906e-01, -1.23997907e-01, -1.83913203e-01,  6.22014169e-01,
        3.66616877e-01, -5.64323585e-01,  9.01282228e-01, -1.42194907e-01,
       -8.91960097e-01, -2.14149889e+00,  8.97293033e-01, -5.96588339e-01,
        1.48114346e+00,  1.60333265e-01, -5.73142520e-01,  7.44016312e-01,
       -1.22085012e+00,  9.55486919e-01,  9.05317718e-01,  4.60729198e-01,
       -3.60035129e-01,  7.61367050e-01,  1.88693995e-01,  4.71975513e-01,
        4.07583861e-01, -8.29810714e-01, -4.46501885e-01,  3.44006812e-01,
        1.49729392e+00,  5.62548741e-01,  1.61669624e+00, -1.17056568e+00,
       -2.64518038e+00,  2.03717097e-01,  2.27034150e-01, -1.02476102e+00,
       -2.83191561e-02, -3.08725011e-01,  1.36350724e+00,  3.40325037e-01,
        2.65108755e-01,  5.04709807e-01,  1.18242807e+00, -4.35327408e-01,
       -3.20013879e-01,  4.71379474e-01,  9.49738790e-01,  3.79633577e-01,
       -1.47387059e+00, -4.33521379e-02, -1.81519999e-01,  1.52056836e+00,
       -9.24909113e-01, -8.51888802e-01, -5.56389172e-02, -2.54865894e-01,
        8.59892622e-01,  1.43583131e+00,  5.51866601e-01,  1.51810568e+00,
       -1.75036860e+00,  1.98888676e+00, -1.99979247e+00,  1.14400936e+00,
        7.16262027e-01, -2.13375722e-01, -8.38369430e-01,  1.01087417e+00,
        2.74290698e-02,  3.97388878e-01, -8.28080186e-01, -7.95930262e-01,
        6.55434555e-02,  7.08900429e-01,  1.06829790e+00,  2.32599071e+00,
        5.15355616e-01, -1.70880050e-01, -1.45128886e-01, -1.61022665e-01,
        8.74660048e-01, -9.61245081e-01,  2.36298261e+00,  5.37451190e-01,
        1.26898892e+00, -4.58238733e-01,  9.12168438e-01,  1.46076957e+00,
        1.64765369e+00, -1.16740966e+00,  4.71711278e-01, -4.44946957e-03,
        7.44546974e-01, -3.41410587e-01, -7.56765527e-01,  1.63552300e+00,
       -7.07065448e-02,  2.98026111e-01, -3.63216524e-01,  5.53729079e-01,
       -6.97613919e-02, -1.68793945e+00, -4.28334713e-01, -5.02968786e-01])

In [128]:
quartiles=pd.qcut(data,4,precision=2)

In [129]:
quartiles

[(0.7, 3.41], (0.7, 3.41], (-0.66, 0.032], (-3.11, -0.66], (0.032, 0.7], ..., (0.032, 0.7], (-0.66, 0.032], (-3.11, -0.66], (-0.66, 0.032], (-0.66, 0.032]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.11, -0.66] < (-0.66, 0.032] < (0.032, 0.7] < (0.7, 3.41]]

In [130]:
pd.value_counts(quartiles)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_45500\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.11, -0.66]    250
(-0.66, 0.032]    250
(0.032, 0.7]      250
(0.7, 3.41]       250
Name: count, dtype: int64

In [131]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-3.101, -1.244]    100
(-1.244, 0.0316]    400
(0.0316, 1.224]     400
(1.224, 3.41]       100
Name: count, dtype: int64


# Detecting and Filtering Outliers

In [151]:
data=pd.DataFrame(np.random.standard_normal((1000,4)))

In [152]:
data

            0         1         2         3
0    0.810900 -0.916399  0.436168  0.549994
1    0.242958 -0.160791  1.287486 -1.335386
2   -0.922054  1.150017 -0.115648  0.391079
3   -0.769177  0.928576  1.214777  0.756846
4   -0.803651 -1.332821  0.309456 -0.073828
..        ...       ...       ...       ...
995 -0.181836 -0.848761  1.718168  0.350029
996  1.353697 -1.372409 -1.443486 -0.879906
997  0.040515  0.719458  0.675076 -0.251764
998  1.640560 -0.391408  1.698854  0.355733
999 -0.410820 -0.158914 -0.330527  1.177124

[1000 rows x 4 columns]

In [153]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026554    -0.016677     0.005972    -0.017697
std       0.994713     0.948939     0.971055     1.026676
min      -2.896423    -2.791413    -3.399079    -3.074274
25%      -0.631211    -0.641661    -0.600270    -0.724481
50%      -0.001835    -0.034751     0.045702    -0.027514
75%       0.722397     0.650594     0.647939     0.689509
max       3.437981     3.231371     3.049216     3.609261

In [154]:
col=data[2]

In [155]:
col

0      0.436168
1      1.287486
2     -0.115648
3      1.214777
4      0.309456
         ...
995    1.718168
996   -1.443486
997    0.675076
998    1.698854
999   -0.330527
Name: 2, Length: 1000, dtype: float64

In [156]:
col[col.abs()>3]

52    -3.126179
65     3.049216
632   -3.399079
Name: 2, dtype: float64

In [157]:
data[(data.abs()>3).any(axis="columns")]

            0         1         2         3
36   0.081042 -1.812720 -1.130081  3.234768
52  -1.885076  1.022188 -3.126179 -0.312911
65   1.190262 -0.958871  3.049216 -0.705813
174 -0.925241 -0.221987  0.639135 -3.074274
213 -0.146655  3.231371 -1.912784 -1.084959
247  3.114580  1.156750  0.334257 -0.386857
467  0.627577 -1.369638  0.415352  3.609261
632 -0.218445 -0.226320 -3.399079 -1.198592
649  3.437981 -0.801845  0.136945 -0.928386
976 -0.125032 -1.590673  1.289214  3.102487

In [159]:
np.sign(data)*3

       0    1    2    3
0    3.0 -3.0  3.0  3.0
1    3.0 -3.0  3.0 -3.0
2   -3.0  3.0 -3.0  3.0
3   -3.0  3.0  3.0  3.0
4   -3.0 -3.0  3.0 -3.0
..   ...  ...  ...  ...
995 -3.0 -3.0  3.0  3.0
996  3.0 -3.0 -3.0 -3.0
997  3.0  3.0  3.0 -3.0
998  3.0 -3.0  3.0  3.0
999 -3.0 -3.0 -3.0  3.0

[1000 rows x 4 columns]

In [160]:
data[data.abs()>3]=np.sign(data)*3

In [161]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026001    -0.016908     0.006448    -0.018569
std       0.992954     0.948175     0.969182     1.023454
min      -2.896423    -2.791413    -3.000000    -3.000000
25%      -0.631211    -0.641661    -0.600270    -0.724481
50%      -0.001835    -0.034751     0.045702    -0.027514
75%       0.722397     0.650594     0.647939     0.689509
max       3.000000     3.000000     3.000000     3.000000

In [162]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1  1.0 -1.0  1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0